In [1]:
import pandas as pd

## Series

###  Creation of Series from Scalar Values

In [2]:
a=pd.Series([10,20,30])
print(a)

0    10
1    20
2    30
dtype: int64

In [3]:
a=pd.Series(["sita","rama","laxmi"],index=['a','b','c'])
print(a)

a     sita
b     rama
c    laxmi
dtype: object

In [4]:
a.describe()

count        3
unique       3
top       sita
freq         1
dtype: object

In [5]:
a1=pd.Series([10,20,30],index=['a','b','c'])
print(a1)

a    10
b    20
c    30
dtype: int64

In [6]:
a1.describe()

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [7]:
a1.count()

3

In [8]:
a1.min()

10

In [9]:
a1.max()

30

In [10]:
a1.mean()

20.0

In [11]:
a1.std()

10.0

In [12]:
a1.isnull()

a    False
b    False
c    False
dtype: bool

In [13]:
a1.isnull().sum()

0

###  Accessing Elements of a Series

In [14]:
a1['b']

20

In [15]:
a1[1]

20

In [16]:
a1[[0,2,1]]

a    10
c    30
b    20
dtype: int64

###  Creation of Series from NumPy Arrays

In [17]:
import numpy as np
import pandas as pd
arr=np.array([1,2,3])
df=pd.Series(arr)
print(arr)
print(type(arr))
print(df)
print(type(df))

[1 2 3]
<class 'numpy.ndarray'>
0    1
1    2
2    3
dtype: int32
<class 'pandas.core.series.Series'>

In [18]:
import numpy as np
import pandas as pd
arr=np.array([1,2,3])
df=pd.Series(arr,index=['a','b','c'])
print(arr)
print(type(arr))
print(df)
print(type(df))

[1 2 3]
<class 'numpy.ndarray'>
a    1
b    2
c    3
dtype: int32
<class 'pandas.core.series.Series'>

### Creation of Series from Dictionary

In [19]:
dict={1:"one",2:"two",3:"three"}
import pandas as pd
dd=pd.Series(dict)
print(dd)
print(type(dd))

1      one
2      two
3    three
dtype: object
<class 'pandas.core.series.Series'>

## DataFrame

In [20]:
a2=pd.DataFrame({
    "Name":["ramu","sita","manu"],
    "Marks":[100,120,150]
})
print(a2)

   Name  Marks
0  ramu    100
1  sita    120
2  manu    150

In [21]:
a2.describe()

            Marks
count    3.000000
mean   123.333333
std     25.166115
min    100.000000
25%    110.000000
50%    120.000000
75%    135.000000
max    150.000000

In [22]:
a2["Name"]

0    ramu
1    sita
2    manu
Name: Name, dtype: object

In [23]:
a2.min()

Name     manu
Marks     100
dtype: object

In [24]:
a2.max()

Name     sita
Marks     150
dtype: object

In [25]:
a2.mean()

Marks    123.333333
dtype: float64

In [26]:
a2.std()

Marks    25.166115
dtype: float64

In [27]:
a2.count()

Name     3
Marks    3
dtype: int64

In [28]:
a2.isnull()

    Name  Marks
0  False  False
1  False  False
2  False  False

In [29]:
a2.isnull().sum()

Name     0
Marks    0
dtype: int64

In [30]:
type(a2)

pandas.core.frame.DataFrame

### Data Importing

In [43]:
data=pd.read_csv("Book1.csv")
print(data)

        Name  Age  class
0  Hymavathi    6      1
1     Bhagya    7      2
2    Srujana    8      3
3      Satya    9      4
4     Yamuna   10      5

### Data accessing

In [33]:
data["Name"]

0    Hymavathi
1       Bhagya
2      Srujana
3        Satya
4       Yamuna
Name: Name, dtype: object

In [34]:
data["Age"]

0     6
1     7
2     8
3     9
4    10
Name: Age, dtype: int64

In [35]:
data.describe()

             Age     class
count   5.000000  5.000000
mean    8.000000  3.000000
std     1.581139  1.581139
min     6.000000  1.000000
25%     7.000000  2.000000
50%     8.000000  3.000000
75%     9.000000  4.000000
max    10.000000  5.000000

In [54]:
data["Name"].describe()

count             5
unique            5
top       Hymavathi
freq              1
Name: Name, dtype: object

In [52]:
data["Age"].describe()

count     5.000000
mean      8.000000
std       1.581139
min       6.000000
25%       7.000000
50%       8.000000
75%       9.000000
max      10.000000
Name: Age, dtype: float64

In [51]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name     5 non-null object
Age      5 non-null int64
class    5 non-null int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

### Operations on Data

In [36]:
data["Age"].sum()

40

In [37]:
data["Age"].max()

10

In [38]:
data["Age"].min()

6

In [39]:
data["Age"].mean()

8.0

In [40]:
data["Age"].std()

1.5811388300841898

In [41]:
data.head(2)

        Name  Age  class
0  Hymavathi    6      1
1     Bhagya    7      2

In [42]:
data.tail(3)

      Name  Age  class
2  Srujana    8      3
3    Satya    9      4
4   Yamuna   10      5

In [45]:
print(data["Age"]>8)

0    False
1    False
2    False
3     True
4     True
Name: Age, dtype: bool

In [53]:
data[data["Age"]>8]

     Name  Age  class
3   Satya    9      4
4  Yamuna   10      5

In [58]:
type(data)

pandas.core.frame.DataFrame

In [60]:
data=pd.read_pdf("Book1.pdf")
print(data)

AttributeError: module 'pandas' has no attribute 'read_pdf'